In [1]:
!pip install mysql.connector-python

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: mysql.connector-python in c:\users\user\appdata\roaming\python\python310\site-packages (8.4.0)

In [2]:
import mysql.connector                        #importing database
database = mysql.connector.connect(
    host="localhost",
    user ="root",
    password ="",
    database = "python_class_8am")
db = database.cursor()

In [3]:
db.execute ("SELECT * FROM student")
result = db.fetchall()                           
for x in result:
    print(x)

(16, 'Shosika', 89, 77, 78, 66, 499, 80, 0.0, 'A')
(17, 'Sita', 44, 55, 67, 88, 88, 520, 80.0, 'A')
(18, 'Siya', 77, 99, 55, 77, 66, 386, 75.0, 'B')
(20, 'Ram', 77, 97, 80, 86, 85, 800, 85.0, 'A+')
(21, 'Hari', 66, 99, 77, 88, 86, 475, 75.0, 'B+')
(22, 'Shyam', 77, 99, 85, 86, 90, 600, 80.0, 'A+')
(24, 'james', 65, 34, 63, 33, 89, 410, 45.0, 'c')
(25, 'juli', 99, 78, 66, 69, 84, 777, 82.0, 'A+')
(26, 'john', 99, 78, 66, 69, 84, 777, 82.0, 'A+')
(28, 'lily', 63, 48, 87, 57, 78, 873, 71.0, 'B')

In [4]:
#insert data into table
sql ='''INSERT INTO `student` (`sn`, `name`, `physics`, `chemistry`, `math`, `english`, `Nepali`, `total`, `per`, `grade`) 
        VALUES ('28', 'lily', '63', '48', '87', '57', '78', '873', '71', 'B');'''
db.execute(sql)
database.commit()
print(db.rowcount,"record instead.")

IntegrityError: 1062 (23000): Duplicate entry '28' for key 'PRIMARY'

In [5]:
math = int(input("Enter Math marks: "))
science = float(input("Enter Science marks: "))
english = int(input("Enter English marks: "))
nepali= int(input("Enter Nepali marks: "))
social = int(input("Enter Social marks: "))


total = math + science + english + nepali + social
percentage = total/5

if percentage >= 90:
    grade = 'A+'
elif percentage >= 80:
    grade = 'A'
elif percentage >= 70:
    grade = 'B'
elif percentage >= 60:
    grade = 'C'
elif percentage >= 50:
    grade = 'D'
else:
    grade = 'Fail'


print("Total =", total)
print("Percentage:", percentage)
print("Grade:", grade)

#insert data into table
sql = f'''INSERT INTO student ( 'name', physics, chemistry, math, english, Nepali, total, per, 'grade')
        VALUES ('{name}',{physics},{chemistry},{math},{english},{nepali},{total},{per},'{grade}')'''
db.execute(sql)
database.commit()
print(db.rowcount,"record instead.")

Enter Math marks: 66
Enter Science marks: 88
Enter English marks: 66
Enter Nepali marks: 88
Enter Social marks: 55
Total = 363.0
Percentage: 72.6
Grade: B

NameError: name 'name' is not defined

In [6]:
#update sql

In [7]:
sql = "UPDATE student SET name = 'Sita' WHERE  sn = '17'"
db.execute(sql)
database.commit()
print(db.rowcount,"record(s) affected")

0 record(s) affected

In [8]:
 # Delete in sql
sql =  "Delete  FROM student Where sn ='23'"
db.execute(sql)
database.commit()
print(db.rowcount,"record(s) deleted")

0 record(s) deleted

In [9]:
# select in sql
db.execute("  SELECT  * FROM student WHERE  grade = 'A' ")
result =db.fetchall()
for x in result:
    print(x)

(16, 'Shosika', 89, 77, 78, 66, 499, 80, 0.0, 'A')
(17, 'Sita', 44, 55, 67, 88, 88, 520, 80.0, 'A')

In [10]:
# search
db.execute("SELECT * FROM student WHERE  name LIKE = '%james%'")
result =db.fetchall()
for x in result:
    print(x)

ProgrammingError: 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use near '= '%james%'' at line 1

In [10]:
#Select

db.execute("  SELECT  * FROM student WHERE  physics>80")
result =db.fetchall()
for x in result:
    print(x)

(16, 'Shosika', 89, 77, 78, 66, 499, 80, 0.0, 'A')
(25, 'juli', 99, 78, 66, 69, 84, 777, 82.0, 'A+')
(26, 'john', 99, 78, 66, 69, 84, 777, 82.0, 'A+')

In [11]:
#Select

db.execute("  SELECT name,total,per,grade FROM student")
result =db.fetchall()
for x in result:
    print(x)

('Shosika', 80, 0.0, 'A')
('Sita', 520, 80.0, 'A')
('Siya', 386, 75.0, 'B')
('Ram', 800, 85.0, 'A+')
('Hari', 475, 75.0, 'B+')
('Shyam', 600, 80.0, 'A+')
('james', 410, 45.0, 'c')
('juli', 777, 82.0, 'A+')
('john', 777, 82.0, 'A+')
('lily', 873, 71.0, 'B')

In [12]:
#Select

db.execute("  SELECT  * FROM student ORDER BY  total ASC ")
result =db.fetchall()
for x in result:
    print(x)

(16, 'Shosika', 89, 77, 78, 66, 499, 80, 0.0, 'A')
(18, 'Siya', 77, 99, 55, 77, 66, 386, 75.0, 'B')
(24, 'james', 65, 34, 63, 33, 89, 410, 45.0, 'c')
(21, 'Hari', 66, 99, 77, 88, 86, 475, 75.0, 'B+')
(17, 'Sita', 44, 55, 67, 88, 88, 520, 80.0, 'A')
(22, 'Shyam', 77, 99, 85, 86, 90, 600, 80.0, 'A+')
(25, 'juli', 99, 78, 66, 69, 84, 777, 82.0, 'A+')
(26, 'john', 99, 78, 66, 69, 84, 777, 82.0, 'A+')
(20, 'Ram', 77, 97, 80, 86, 85, 800, 85.0, 'A+')
(28, 'lily', 63, 48, 87, 57, 78, 873, 71.0, 'B')

In [13]:

db.execute("  SELECT  * FROM student ORDER BY  total DESC ")
result =db.fetchall()
for x in result:
    print(x)

(28, 'lily', 63, 48, 87, 57, 78, 873, 71.0, 'B')
(20, 'Ram', 77, 97, 80, 86, 85, 800, 85.0, 'A+')
(25, 'juli', 99, 78, 66, 69, 84, 777, 82.0, 'A+')
(26, 'john', 99, 78, 66, 69, 84, 777, 82.0, 'A+')
(22, 'Shyam', 77, 99, 85, 86, 90, 600, 80.0, 'A+')
(17, 'Sita', 44, 55, 67, 88, 88, 520, 80.0, 'A')
(21, 'Hari', 66, 99, 77, 88, 86, 475, 75.0, 'B+')
(24, 'james', 65, 34, 63, 33, 89, 410, 45.0, 'c')
(18, 'Siya', 77, 99, 55, 77, 66, 386, 75.0, 'B')
(16, 'Shosika', 89, 77, 78, 66, 499, 80, 0.0, 'A')

In [14]:

db.execute("  SELECT  * FROM student ORDER BY  total ASC ")
result =db.fetchall()
for x in result[0:10]:
    print(x)

(16, 'Shosika', 89, 77, 78, 66, 499, 80, 0.0, 'A')
(18, 'Siya', 77, 99, 55, 77, 66, 386, 75.0, 'B')
(24, 'james', 65, 34, 63, 33, 89, 410, 45.0, 'c')
(21, 'Hari', 66, 99, 77, 88, 86, 475, 75.0, 'B+')
(17, 'Sita', 44, 55, 67, 88, 88, 520, 80.0, 'A')
(22, 'Shyam', 77, 99, 85, 86, 90, 600, 80.0, 'A+')
(25, 'juli', 99, 78, 66, 69, 84, 777, 82.0, 'A+')
(26, 'john', 99, 78, 66, 69, 84, 777, 82.0, 'A+')
(20, 'Ram', 77, 97, 80, 86, 85, 800, 85.0, 'A+')
(28, 'lily', 63, 48, 87, 57, 78, 873, 71.0, 'B')